:PREAMBLE:
#+title: Epkgs: Orphanage
#+setupfile: .orgconfig
#+name: setup
#+begin_src emacs-lisp :results silent
  (require 'emir)

  (defconst emir--orphans-cache
    (cl-delete-if (##member (cdr (assq 'name %))
                            '(".github" "p"))
                  (sort (ghub-get "/orgs/emacsorphanage/repos" nil
                                  :unpaginate t
                                  :auth 'emir)
                        :key (##cdr (assq 'name %)))))

  (defun emir--list-orphans (&optional only columns-fn sort-column)
    (let ((table
           (seq-keep
            (lambda (elt)
              (let* ((name (cdr (assq 'name elt)))
                     (name (if (equal name "image-plus") "image+" name))
                     (pkg  (epkg name))
                     (type (and pkg (closql--abbrev-class (eieio-object-class pkg))))
                     (rcp  (epkg-get-recipe 'melpa name))
                     (reason (emir--config name :orphanage)))
                (and (or (not only)
                         (member reason only))
                     `(,name
                       ,(if pkg (if (eq type 'orphaned) "✔" type) "")
                       ,(if rcp
                            (if (string-prefix-p "emacsorphanage/" (oref rcp repo))
                                "✔"
                              (closql--abbrev-class (eieio-object-class rcp)))
                          "")
                       ,@(and columns-fn (funcall columns-fn name))))))
            emir--orphans-cache)))
      (when sort-column
        (setq table (sort table :key (##nth sort-column %))))
      (epkg-add-org-header table '("Package" "E" "M"))))
#+end_src
#+name: addheader
#+header: :var header="" :var rows=""
#+begin_src elisp :hlines yes :results none
  (epkg-add-org-header rows header)
#+end_src
[[https://emacsmirror.net/stats][up]]
:END:
* Legend

In the below tables, a ✔ in the /E/ column means that a package is
mirrored on the Emacsmirror, while a ✔ in the /M/ column means that
a package is available from Melpa.

* Dropped of by maintainer
:PROPERTIES:
:ID:       c3c2ed97-b25b-4826-9501-b1020ee035f2
:END:
#+name: dropped
#+begin_src emacs-lisp
  (emir--list-orphans (list "dropped by maintainer"))
#+end_src
#+results: dropped
| Package (88)         | E | M |
|----------------------+---+---|
| ac-alchemist         | ✔ | ✔ |
| ac-capf              | ✔ | ✔ |
| ac-emoji             | ✔ | ✔ |
| ac-etags             | ✔ | ✔ |
| ac-ispell            | ✔ | ✔ |
| ac-racer             | ✔ | ✔ |
| ansible-doc          | ✔ | ✔ |
| anzu                 | ✔ | ✔ |
| applescript-mode     | ✔ | ✔ |
| codic                | ✔ | ✔ |
| company-jedi         | ✔ | ✔ |
| cpp-auto-include     | ✔ | ✔ |
| dart-mode            | ✔ | ✔ |
| dired-k              | ✔ | ✔ |
| direx                | ✔ | ✔ |
| docean               | ✔ | ✔ |
| easy-highlight       | ✔ |   |
| emamux               | ✔ | ✔ |
| emamux-ruby-test     | ✔ | ✔ |
| evil-anzu            | ✔ | ✔ |
| evil-textobj-line    | ✔ | ✔ |
| fancy-battery        | ✔ | ✔ |
| farmhouse-themes     | ✔ | ✔ |
| fontawesome          | ✔ | ✔ |
| gh-md                | ✔ | ✔ |
| git-gutter           | ✔ | ✔ |
| git-gutter-fringe    | ✔ | ✔ |
| git-messenger        | ✔ | ✔ |
| go-add-tags          | ✔ | ✔ |
| go-direx             | ✔ | ✔ |
| go-eldoc             | ✔ | ✔ |
| go-impl              | ✔ | ✔ |
| god-mode             | ✔ | ✔ |
| gom-mode             | ✔ | ✔ |
| haxe-mode            | ✔ | ✔ |
| helm-ack             | ✔ | ✔ |
| helm-ag              | ✔ | ✔ |
| helm-css-scss        | ✔ | ✔ |
| helm-github-issues   | ✔ |   |
| helm-gtags           | ✔ | ✔ |
| helm-haskell-import  | ✔ |   |
| helm-ispell          | ✔ | ✔ |
| helm-open-github     | ✔ | ✔ |
| helm-package         | ✔ |   |
| helm-perldoc         | ✔ | ✔ |
| helm-pydoc           | ✔ | ✔ |
| helm-robe            | ✔ | ✔ |
| helm-swoop           | ✔ | ✔ |
| helm-themes          | ✔ | ✔ |
| help-find-org-mode   | ✔ | ✔ |
| import-popwin        | ✔ | ✔ |
| jedi-eldoc           | ✔ |   |
| konoha-mode          | ✔ |   |
| libegit2             |   |   |
| literate-coffee-mode | ✔ | ✔ |
| ltsv                 | ✔ |   |
| magit-gerrit         | ✔ | ✔ |
| magit-p4             | ✔ | ✔ |
| magit-svn            | ✔ | ✔ |
| manage-minor-mode    | ✔ | ✔ |
| mongo                | ✔ | ✔ |
| octicons             | ✔ | ✔ |
| opam                 | ✔ | ✔ |
| org-page             | ✔ | ✔ |
| org-redmine          | ✔ | ✔ |
| osx-trash            | ✔ | ✔ |
| ov                   | ✔ | ✔ |
| perl-utils           | ✔ |   |
| pkg-info             | ✔ | ✔ |
| popup-complete       | ✔ | ✔ |
| popwin               | ✔ | ✔ |
| pyimpsort            | ✔ | ✔ |
| pylint               | ✔ | ✔ |
| qt-pro-mode          | ✔ | ✔ |
| quickrun             | ✔ | ✔ |
| req-package          | ✔ | ✔ |
| reverse-theme        | ✔ | ✔ |
| smeargle             | ✔ | ✔ |
| sound-wav            | ✔ | ✔ |
| sourcemap            | ✔ | ✔ |
| splitjoin            | ✔ | ✔ |
| swoop                | ✔ | ✔ |
| test-more            | ✔ |   |
| thingopt             | ✔ | ✔ |
| tora-mode            | ✔ |   |
| undohist             | ✔ | ✔ |
| yascroll             | ✔ | ✔ |
| zoom-window          | ✔ | ✔ |

* Upstream has disappeared but there are dependents
:PROPERTIES:
:ID:       5428bc8d-7949-40ff-bcca-d21fcbf4849e
:END:

The upstream repository or file download for these packages has
disappeared.

Or at least it wasn't available for a long time; in some cases the
upstream might be available again.  I do not check to make sure this
is not the case.  If you find such a package, then please let me know.

Of course there are many more packages whose upstream has disappeared,
then those listed here, many of which can be found on the Emacsattic.

Those unmaintained packages that made it into the orphanage instead of
just the attic, did so because other mirrored packages depend on them,
and/or because they are available from Melpa (I mirror all packages
that are available from there).

#+name: disappeared
#+begin_src emacs-lisp
  (emir--list-orphans (list "upstream disappeared"))
#+end_src
#+results: disappeared
| Package (10) | E | M |
|--------------+---+---|
| dedicated    | ✔ | ✔ |
| ecasound     | ✔ |   |
| image+       | ✔ | ✔ |
| keydef       | ✔ | ✔ |
| miniedit     | ✔ | ✔ |
| osd          | ✔ |   |
| pager        | ✔ | ✔ |
| smarty-mode  | ✔ | ✔ |
| tail         | ✔ |   |
| vm           | ✔ |   |

* Upstream is unresponsive but there are issues
:PROPERTIES:
:ID:       f8703683-84ea-4a2c-9774-83bb3703aac8
:END:

The upstream repositories for these packages still existed (or at
least they still existed when the packages were added here), but the
packages have issues that have to be fixed and the maintainers did not
respond when I contacted them.  I have patched these packages here in
the orphanage to fix these issues.

- Multiple packages bundle ~hyperspec~ but none of them is the
  authoritive upstream.  Attempts to get the various non-upstreams
  talking have failed so far.

#+name: unresponsive
#+begin_src emacs-lisp
  (emir--list-orphans (list "upstream unresponsive" "multiple non-upstreams"))
#+end_src
#+results: unresponsive
| Package (16)           | E | M |
|------------------------+---+---|
| edb                    | ✔ |   |
| elisp-depend           | ✔ | ✔ |
| evil-escape            | ✔ | ✔ |
| helm-gitignore         | ✔ | ✔ |
| hyperspec              | ✔ |   |
| macrostep              | ✔ | ✔ |
| nav                    | ✔ | ✔ |
| oberon                 | ✔ | ✔ |
| omtose-phellack-themes | ✔ | ✔ |
| ox-pandoc              | ✔ | ✔ |
| read-char-spec         | ✔ |   |
| setnu                  | ✔ |   |
| tablist                | ✔ | ✔ |
| transient-posframe     | ✔ | ✔ |
| which-key-posframe     | ✔ | ✔ |
| yafolding              | ✔ | ✔ |

* Wiki packages needed by non-wiki packages
:PROPERTIES:
:ID:       09e75274-9792-4670-8847-507cd2b28776
:END:

These packages are being distributed on the Emacswiki and other
packages that are not distributed on the Emacswiki depend on them.

Anyone can edit packages on the Emacswiki, which is a big security
risk, so the Emacsmirror mirrors a frozen copy from the orphanage
instead of the world-writable copy from the wiki.

Melpa also uses the frozen copies, see issue [[https://github.com/melpa/melpa/issues/2342][#2342]].

We should occationally review updates to these packages to make new
versions available to the Emacsmirror and Melpa, but at present we
don't do that.

#+name: required-by-nonwiki
#+begin_src emacs-lisp
  (emir--list-orphans
   (list "wiki needed by non-wiki")
   ;; (lambda (name)
   ;;   (let ((pkg (epkg name)))
   ;;     (list (oref pkg updated)
   ;;           (format "%s" (car (oref pkg maintainers)))
   ;;           (mapconcat (pcase-lambda (`(,dependant ,_))
   ;;                        (format "%s (%s)" dependant
   ;;                                (ignore-errors
   ;;                                  (closql--abbrev-class
   ;;                                   (eieio-object-class (epkg dependant))))))
   ;;                      (epkg-reverse-dependencies name)
   ;;                      ", "))))
   ;; 3
   )
#+end_src
#+results: required-by-nonwiki
| Package (23)     | E | M |
|------------------+---+---|
| cygwin-mount     | ✔ |   |
| dirtree          | ✔ | ✔ |
| ert-expectations | ✔ | ✔ |
| findr            | ✔ | ✔ |
| highline         | ✔ |   |
| http-post-simple | ✔ | ✔ |
| key-chord        | ✔ | ✔ |
| later-do         | ✔ |   |
| levenshtein      | ✔ | ✔ |
| oddmuse          | ✔ |   |
| org-json         | ✔ |   |
| policy-switch    | ✔ |   |
| run-assoc        | ✔ |   |
| screenshot       | ✔ |   |
| shell-history    | ✔ | ✔ |
| showtip          | ✔ | ✔ |
| sr-speedbar      | ✔ | ✔ |
| transpose-frame  | ✔ | ✔ |
| tree-mode        | ✔ | ✔ |
| unit-test        | ✔ |   |
| w32-browser      | ✔ | ✔ |
| windata          | ✔ | ✔ |
| yaoddmuse        | ✔ |   |

* New
:PROPERTIES:
:ID:       facb6c4a-6c45-487b-b099-54f8677cccd6
:END:
#+name: new
#+begin_src emacs-lisp
  (emir--list-orphans (list nil))
#+end_src
#+results: new

